### Terraform Plan — `prod`

```
module.doubleday.null_resource.lambda_deps: Refreshing state... [id=6882248154193062499]
module.doubleday.null_resource.lambda_package_build: Refreshing state... [id=2914348085779931580]
module.doubleday.data.archive_file.lambda_package: Reading...
module.doubleday.module.lambda.aws_iam_role.gold_load: Refreshing state... [id=doubleday-prod-gold-load]
module.doubleday.module.step_function.aws_cloudwatch_log_group.pipeline: Refreshing state... [id=/aws/stepfunction/doubleday-prod-pipeline]
module.doubleday.module.api.aws_iam_role.authorizer: Refreshing state... [id=doubleday-prod-api-authorizer]
module.doubleday.module.lambda.aws_iam_role.bronze_load: Refreshing state... [id=doubleday-prod-bronze-load]
module.doubleday.module.api.data.aws_route53_zone.main: Reading...
module.doubleday.module.api.aws_iam_role.query_pitches: Refreshing state... [id=doubleday-prod-api-query-pitches]
module.doubleday.module.api.aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:us-east-1:291743709387:certificate/7ada0a68-6e8d-41bf-9d53-b9bfecfb4856]
module.doubleday.module.s3.aws_s3_bucket.lakehouse: Refreshing state... [id=doubleday-prod-lakehouse]
module.doubleday.module.glue.aws_glue_catalog_database.main: Refreshing state... [id=291743709387:doubleday_prod]
module.doubleday.module.lambda.aws_iam_role.clear_staging: Refreshing state... [id=doubleday-prod-clear-staging]
module.doubleday.data.aws_secretsmanager_secret_version.google_oauth: Reading...
module.doubleday.module.step_function.aws_iam_role.pipeline: Refreshing state... [id=doubleday-prod-pipeline]
module.doubleday.module.lambda.aws_iam_role.silver_load: Refreshing state... [id=doubleday-prod-silver-load]
module.doubleday.module.api.aws_iam_role.authorizer_invocation: Refreshing state... [id=doubleday-prod-api-auth-invocation]
module.doubleday.module.lambda.aws_iam_role.validate_input: Refreshing state... [id=doubleday-prod-validate-input]
module.doubleday.data.aws_secretsmanager_secret_version.google_oauth: Read complete after 0s [id=prod/doubleday/cognito_identity_provider/google_client_id|AWSCURRENT]
module.doubleday.module.api.aws_iam_role_policy.authorizer: Refreshing state... [id=doubleday-prod-api-authorizer:doubleday-prod-api-authorizer]
module.doubleday.data.archive_file.lambda_package: Read complete after 1s [id=004d7b6a25907aa8eeb93eb264aef4b0f4a30da2]
module.doubleday.module.api.aws_lambda_function.query_pitches: Refreshing state... [id=doubleday-prod-api-query-pitches]
module.doubleday.module.lambda.aws_lambda_function.gold_load: Refreshing state... [id=doubleday-prod-gold-load]
module.doubleday.module.s3.aws_s3_bucket_public_access_block.lakehouse: Refreshing state... [id=doubleday-prod-lakehouse]
module.doubleday.module.lambda.aws_lambda_function.clear_staging: Refreshing state... [id=doubleday-prod-clear-staging]
module.doubleday.module.s3.aws_s3_bucket_server_side_encryption_configuration.lakehouse: Refreshing state... [id=doubleday-prod-lakehouse]
module.doubleday.module.api.data.aws_route53_zone.main: Read complete after 0s [id=Z1WGWAH1KA6CLS]
module.doubleday.module.lambda.aws_iam_role_policy.gold_load: Refreshing state... [id=doubleday-prod-gold-load:doubleday-prod-gold-load]
module.doubleday.module.lambda.aws_iam_role_policy.bronze_load: Refreshing state... [id=doubleday-prod-bronze-load:doubleday-prod-bronze-load]
module.doubleday.module.api.aws_iam_role_policy.query_pitches: Refreshing state... [id=doubleday-prod-api-query-pitches:doubleday-prod-api-query-pitches]
module.doubleday.module.lambda.aws_iam_role_policy.clear_staging: Refreshing state... [id=doubleday-prod-clear-staging:doubleday-prod-clear-staging]
module.doubleday.module.lambda.aws_lambda_function.bronze_load: Refreshing state... [id=doubleday-prod-bronze-load]
module.doubleday.module.glue.null_resource.gold_pitches_shape_season_table: Refreshing state... [id=3679298051484024578]
module.doubleday.module.api.aws_route53_record.cert_validation["doubleday.appleforge.com"]: Refreshing state... [id=Z1WGWAH1KA6CLS__7d799900fc948135bb9557ad87d84f64.doubleday.appleforge.com._CNAME]
module.doubleday.module.glue.null_resource.silver_pitches_table: Refreshing state... [id=6545119109490943370]
module.doubleday.module.lambda.aws_iam_role_policy.silver_load: Refreshing state... [id=doubleday-prod-silver-load:doubleday-prod-silver-load]
module.doubleday.module.lambda.aws_lambda_function.silver_load: Refreshing state... [id=doubleday-prod-silver-load]
module.doubleday.module.glue.aws_glue_catalog_table.bronze_statcast: Refreshing state... [id=291743709387:doubleday_prod:bronze_statcast]
module.doubleday.module.lambda.aws_lambda_function.validate_input: Refreshing state... [id=doubleday-prod-validate-input]
module.doubleday.module.lambda.aws_iam_role_policy.validate_input: Refreshing state... [id=doubleday-prod-validate-input:doubleday-prod-validate-input]
module.doubleday.module.glue.null_resource.silver_pitches_staging_table: Refreshing state... [id=1918109444834322555]
module.doubleday.module.api.aws_acm_certificate_validation.api: Refreshing state... [id=2026-02-17 15:15:00.272 +0000 UTC]
module.doubleday.module.step_function.aws_iam_role_policy.pipeline: Refreshing state... [id=doubleday-prod-pipeline:doubleday-prod-pipeline]
module.doubleday.module.step_function.aws_sfn_state_machine.pipeline: Refreshing state... [id=arn:aws:states:us-east-1:291743709387:stateMachine:doubleday-prod-pipeline]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.doubleday.module.api.aws_api_gateway_api_key.main will be created
  + resource "aws_api_gateway_api_key" "main" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "doubleday-prod-api-key"
      + tags_all          = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + value             = (sensitive value)
    }

  # module.doubleday.module.api.aws_api_gateway_authorizer.cognito will be created
  + resource "aws_api_gateway_authorizer" "cognito" {
      + arn                              = (known after apply)
      + authorizer_credentials           = "arn:aws:iam::291743709387:role/doubleday-prod-api-auth-invocation"
      + authorizer_result_ttl_in_seconds = 300
      + authorizer_uri                   = (known after apply)
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.Authorization"
      + name                             = "doubleday-prod-cognito"
      + rest_api_id                      = (known after apply)
      + type                             = "TOKEN"
    }

  # module.doubleday.module.api.aws_api_gateway_base_path_mapping.main will be created
  + resource "aws_api_gateway_base_path_mapping" "main" {
      + api_id      = (known after apply)
      + domain_name = "doubleday.appleforge.com"
      + id          = (known after apply)
      + stage_name  = "prod"
    }

  # module.doubleday.module.api.aws_api_gateway_deployment.main will be created
  + resource "aws_api_gateway_deployment" "main" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_domain_name.main will be created
  + resource "aws_api_gateway_domain_name" "main" {
      + arn                                    = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "doubleday.appleforge.com"
      + domain_name_id                         = (known after apply)
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + regional_certificate_arn               = "arn:aws:acm:us-east-1:291743709387:certificate/7ada0a68-6e8d-41bf-9d53-b9bfecfb4856"
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = (known after apply)
      + tags_all                               = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }

      + endpoint_configuration {
          + ip_address_type = (known after apply)
          + types           = [
              + "REGIONAL",
            ]
        }
    }

  # module.doubleday.module.api.aws_api_gateway_integration.get_pitches will be created
  + resource "aws_api_gateway_integration" "get_pitches" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-api-query-pitches/invocations"
    }

  # module.doubleday.module.api.aws_api_gateway_integration.options_pitches will be created
  + resource "aws_api_gateway_integration" "options_pitches" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.doubleday.module.api.aws_api_gateway_integration_response.options_pitches will be created
  + resource "aws_api_gateway_integration_response" "options_pitches" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.doubleday.module.api.aws_api_gateway_method.get_pitches will be created
  + resource "aws_api_gateway_method" "get_pitches" {
      + api_key_required = true
      + authorization    = "CUSTOM"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_method.options_pitches will be created
  + resource "aws_api_gateway_method" "options_pitches" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_method_response.options_pitches will be created
  + resource "aws_api_gateway_method_response" "options_pitches" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.doubleday.module.api.aws_api_gateway_resource.pitcher will be created
  + resource "aws_api_gateway_resource" "pitcher" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{pitcher_id}"
      + rest_api_id = (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_resource.pitchers will be created
  + resource "aws_api_gateway_resource" "pitchers" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "pitchers"
      + rest_api_id = (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_resource.pitches will be created
  + resource "aws_api_gateway_resource" "pitches" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "pitches"
      + rest_api_id = (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_rest_api.main will be created
  + resource "aws_api_gateway_rest_api" "main" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Doubleday REST API (prod)"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "doubleday-prod-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }

      + endpoint_configuration (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_stage.main will be created
  + resource "aws_api_gateway_stage" "main" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + web_acl_arn   = (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_usage_plan.main will be created
  + resource "aws_api_gateway_usage_plan" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "doubleday-prod-usage-plan"
      + tags_all = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }

      + api_stages {
          + api_id = (known after apply)
          + stage  = "prod"
        }

      + throttle_settings {
          + burst_limit = 100
          + rate_limit  = 50
        }
    }

  # module.doubleday.module.api.aws_api_gateway_usage_plan_key.main will be created
  + resource "aws_api_gateway_usage_plan_key" "main" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # module.doubleday.module.api.aws_iam_role_policy.authorizer_invocation will be created
  + resource "aws_iam_role_policy" "authorizer_invocation" {
      + id          = (known after apply)
      + name        = "doubleday-prod-api-auth-invocation"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "doubleday-prod-api-auth-invocation"
    }

  # module.doubleday.module.api.aws_lambda_function.authorizer will be created
  + resource "aws_lambda_function" "authorizer" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/doubleday/../../../builds/lambda_package.zip"
      + function_name                  = "doubleday-prod-api-authorizer"
      + handler                        = "doubleday.api.authorizer.handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-1:017000801446:layer:AWSLambdaPowertoolsPythonV3-python312-x86_64:15",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::291743709387:role/doubleday-prod-api-authorizer"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "YspjhOKj0e8Cudz9LeCn3rbi/6BHwfi1tmqui7ssDjY="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.doubleday.module.api.aws_lambda_function.query_pitches will be updated in-place
  ~ resource "aws_lambda_function" "query_pitches" {
        id                             = "doubleday-prod-api-query-pitches"
      ~ last_modified                  = "2026-02-17T15:14:51.577+0000" -> (known after apply)
      ~ source_code_hash               = "oR72bYEkHDTSfY1biuj3V1fqxxHk2bDxlY2vDs1mET8=" -> "YspjhOKj0e8Cudz9LeCn3rbi/6BHwfi1tmqui7ssDjY="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.api.aws_lambda_permission.authorizer will be created
  + resource "aws_lambda_permission" "authorizer" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "doubleday-prod-api-authorizer"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.doubleday.module.api.aws_lambda_permission.query_pitches will be created
  + resource "aws_lambda_permission" "query_pitches" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "doubleday-prod-api-query-pitches"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.doubleday.module.api.aws_route53_record.api will be created
  + resource "aws_route53_record" "api" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "doubleday.appleforge.com"
      + type            = "A"
      + zone_id         = "Z1WGWAH1KA6CLS"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.doubleday.module.cognito.aws_cognito_identity_provider.google will be created
  + resource "aws_cognito_identity_provider" "google" {
      + attribute_mapping = {
          + "email"    = "email"
          + "username" = "sub"
        }
      + id                = (known after apply)
      + provider_details  = {
          + "authorize_scopes" = "openid email profile"
          + "client_id"        = (sensitive value)
          + "client_secret"    = (sensitive value)
        }
      + provider_name     = "Google"
      + provider_type     = "Google"
      + user_pool_id      = (known after apply)
    }

  # module.doubleday.module.cognito.aws_cognito_user_pool.main will be created
  + resource "aws_cognito_user_pool" "main" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "doubleday-prod"
      + sms_verification_message   = (known after apply)
      + tags_all                   = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + user_pool_tier             = (known after apply)
      + username_attributes        = [
          + "email",
        ]

      + admin_create_user_config (known after apply)

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = false
          + require_uppercase                = true
          + temporary_password_validity_days = (known after apply)
        }

      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "email"
          + required            = true

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "1"
            }
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + username_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # module.doubleday.module.cognito.aws_cognito_user_pool_client.main will be created
  + resource "aws_cognito_user_pool_client" "main" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client          = true
      + allowed_oauth_scopes                          = [
          + "email",
          + "openid",
          + "profile",
        ]
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = [
          + "https://doubleday.appleforge.com/callback",
        ]
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = (known after apply)
      + generate_secret                               = false
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = [
          + "https://doubleday.appleforge.com",
        ]
      + name                                          = "doubleday-prod-client"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + supported_identity_providers                  = [
          + "Google",
        ]
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)
    }

  # module.doubleday.module.cognito.aws_cognito_user_pool_domain.main will be created
  + resource "aws_cognito_user_pool_domain" "main" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "doubleday-prod"
      + id                              = (known after apply)
      + managed_login_version           = (known after apply)
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = (known after apply)
      + version                         = (known after apply)
    }

  # module.doubleday.module.lambda.aws_lambda_function.bronze_load will be updated in-place
  ~ resource "aws_lambda_function" "bronze_load" {
        id                             = "doubleday-prod-bronze-load"
      ~ last_modified                  = "2026-02-17T15:14:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "oR72bYEkHDTSfY1biuj3V1fqxxHk2bDxlY2vDs1mET8=" -> "YspjhOKj0e8Cudz9LeCn3rbi/6BHwfi1tmqui7ssDjY="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.lambda.aws_lambda_function.clear_staging will be updated in-place
  ~ resource "aws_lambda_function" "clear_staging" {
        id                             = "doubleday-prod-clear-staging"
      ~ last_modified                  = "2026-02-17T15:15:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "oR72bYEkHDTSfY1biuj3V1fqxxHk2bDxlY2vDs1mET8=" -> "YspjhOKj0e8Cudz9LeCn3rbi/6BHwfi1tmqui7ssDjY="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.lambda.aws_lambda_function.gold_load will be updated in-place
  ~ resource "aws_lambda_function" "gold_load" {
        id                             = "doubleday-prod-gold-load"
      ~ last_modified                  = "2026-02-17T15:15:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "oR72bYEkHDTSfY1biuj3V1fqxxHk2bDxlY2vDs1mET8=" -> "YspjhOKj0e8Cudz9LeCn3rbi/6BHwfi1tmqui7ssDjY="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.lambda.aws_lambda_function.silver_load will be updated in-place
  ~ resource "aws_lambda_function" "silver_load" {
        id                             = "doubleday-prod-silver-load"
      ~ last_modified                  = "2026-02-17T15:15:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "oR72bYEkHDTSfY1biuj3V1fqxxHk2bDxlY2vDs1mET8=" -> "YspjhOKj0e8Cudz9LeCn3rbi/6BHwfi1tmqui7ssDjY="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.lambda.aws_lambda_function.validate_input will be updated in-place
  ~ resource "aws_lambda_function" "validate_input" {
        id                             = "doubleday-prod-validate-input"
      ~ last_modified                  = "2026-02-17T15:15:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "oR72bYEkHDTSfY1biuj3V1fqxxHk2bDxlY2vDs1mET8=" -> "YspjhOKj0e8Cudz9LeCn3rbi/6BHwfi1tmqui7ssDjY="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 27 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

*Triggered by @dcbove in #9*